// configs/point-system.js
module.exports = {
  name: "Point System",
  webhookUrl:
    "https://discord.com/api/webhooks/1311249041706975232/OR9FZ_F562ZPSYVzUpeUOI6FkNRKgjl2RabXAoN_QzTUNPzFge4FuFAn8Eoy9O_D_PAW",
  webhookConfig: {
    name: "Секретать EMS",
    avatarUrl: "https://i.imgur.com/3tHBIle.jpeg",
  },
  messageTitle: "",
  footer: "for EMS by Brian (ds: jellycolonel)",
  categories: {
    commonPromotionSystem: {
      title:
        "<:pencilWhite:1282332765613981810>Система повышения EMS<:pencilWhite:1282332765613981810>",
      color: "ff6161",
      fields: [
        {
          name: "<:1045037119904694332:1280857061332095051>Повышение с <:1hui:1282332267376803851> на <:2hui:1282332269184286762> ранг:",
          value:
            "<:1057686403556835339:1280857058937405510>Пройти __инструктаж__ у сотрудника DI\n<:1057686403556835339:1280857058937405510>Получить __удостоверение__ в Мэрии",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: true,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Повышение с <:2hui:1282332269184286762> на <:3hui:1282332271520645255> ранг:",
          value:
            "<:1057686403556835339:1280857058937405510>__70 баллов__\n<:Licyxa:1282332767409012807>*[Обязательно выдать 40 таблеток в PillBox и 15 таблеток в больницах Sandy Shores/PaletoBay]*<:Licyxa:1282332767409012807>\n<:1057686403556835339:1280857058937405510>__Сдать экзамен__ на знание устава EMS и RP задание",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: true,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Повышение с <:3hui:1282332271520645255> на <:4hui:1282332273860939829> ранг:",
          value:
            "<:1057686403556835339:1280857058937405510>__Сдать__ устный и практический __экзамен__ у сотрудника DI\n<:1057686403556835339:1280857058937405510>Набрать __100 баллов__\n<:Licyxa:1282332767409012807>*[Из которых обязательно 70 таблеток и 15 вакцин]*<:Licyxa:1282332767409012807>\n<:1057686403556835339:1280857058937405510>__Присутствовать на реанимации__ 5-и игроков с 4+ рангом.\n<:Licyxa:1282332767409012807>*[При условии что дефибрилляторы выдают / есть эпинефрин на складе.]*<:Licyxa:1282332767409012807>",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: true,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Повышение с <:4hui:1282332273860939829> на <:5hui:1282332275651903542> ранг:",
          value:
            "<:1057686403556835339:1280857058937405510>Набрать __140 баллов__.\n<:1057686403556835339:1280857058937405510>Получить __дефибриллятор__.\n<:Licyxa:1282332767409012807>(Обязательно 70% работы отдела в отчете)<:Licyxa:1282332767409012807>",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: true,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Повышение с <:5hui:1282332275651903542> на <:6:1282332277367505057> ранг:",
          value:
            "<:1057686403556835339:1280857058937405510>Набрать __190 баллов__.\n<:Licyxa:1282332767409012807>(Обязательно 70% работы отдела в отчете)<:Licyxa:1282332767409012807>",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: true,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Повышение с <:6:1282332277367505057> на <:7:1282332279560994897> ранг:",
          value:
            "<:1057686403556835339:1280857058937405510>Набрать __235 баллов__.\n<:Licyxa:1282332767409012807>(Обязательно 70% работы отдела в отчете)<:Licyxa:1282332767409012807>",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: true,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Повышение с <:7:1282332279560994897> на <:8_:1282332281284988928> ранг:",
          value:
            "<:1057686403556835339:1280857058937405510>Набрать __285 баллов__.\n<:Licyxa:1282332767409012807>(Обязательно 70% работы отдела в отчете)<:Licyxa:1282332767409012807>",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: true,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Повышение с <:8_:1282332281284988928> на <:9hui:1282332282933219494> ранг:",
          value:
            "<:1057686403556835339:1280857058937405510>Набрать __350 баллов__.\n<:Licyxa:1282332767409012807>(Обязательно 70% работы отдела в отчете)<:Licyxa:1282332767409012807>",
          inline: false,
        },
      ],
      image: {
        url: "https://i.imgur.com/6qCgf19.jpeg",
      },
    },
    commonPoints: {
      title: "Общая система баллов",
      color: "ff6161",
      fields: [
        {
          name: "<:1045037119904694332:1280857061332095051>Выдача таблетки:",
          value:
            "<:1057686403556835339:1280857058937405510>В больнице Pillbox Hill - 1 Балл\n<:1057686403556835339:1280857058937405510>В больницах Sandy Shores / Paleto Bay - 2 Балла",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Выдача вакцин:",
          value:
            "<:1057686403556835339:1280857058937405510>В больнице Pillbox Hill - 2 Балла\n<:1057686403556835339:1280857058937405510>В больницах Sandy Shores / Paleto Bay - 4 Балла",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Оказание ПМП:",
          value:
            "<:1057686403556835339:1280857058937405510>Днём *(08:00 - 22:00)* в городе - 3 Балла\n<:1057686403556835339:1280857058937405510>Днём *(08:00 - 22:00)* в пригороде - 4 Балла\n<:1057686403556835339:1280857058937405510>Ночью *(22:00 - 08:00)* в городе - 5 Балла\n<:1057686403556835339:1280857058937405510>Ночью *(22:00 - 08:00)* в пригороде - 6 Балла",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Прочее:",
          value:
            "<:1057686403556835339:1280857058937405510>Мероприятия/Благодаронсть - 35 Баллов\n<:1057686403556835339:1280857058937405510>Поставка - 69 Баллов\n<:Licyxa:1282332767409012807> За заслуги, ЗГВ/ГВ могут выписать дополнительные баллы по своему усмотрению",
          inline: false,
        },
      ],
      image: {
        url: "https://cdn.discordapp.com/attachments/1251467878230786059/1300514450360762401/logo_ems.png?ex=674e99b7&is=674d4837&hm=acccf292b46cdf9e46f8adbf2f833df6a6bae566e4707815bb429e89a621b2c6&",
      },
    },
  },
};
