// configs/point-system.js
module.exports = {
  name: "Point System",
  webhookUrl:
    "https://discord.com/api/webhooks/1300507554539110471/MslfS6GSWY4H-VEhf9dET4HLfejyEQHFw3--Jtq5vCK4kyTO2BLBW3ssvaHwJdVNdmYO",
  webhookConfig: {
    name: "Секретать EMS",
    avatarUrl: "https://i.imgur.com/3tHBIle.jpeg",
  },
  messageTitle: "",
  footer: "for EMS by Brian (ds: jellycolonel)",
  footerImage: "https://i.imgur.com/fV3lfrO.jpeg",
  categories: {
    diPoints: {
      title: "Система баллов для отдела DI",
      color: "2ecc71",
      fields: [
        {
          name: "<:1045037119904694332:1280857061332095051>Принятие человека в организацию:",
          value:
            "<:1057686403556835339:1280857058937405510>Удачное собеседование - 20 Баллов\n<:1057686403556835339:1280857058937405510>Неудачное собеседование - 7 Баллов",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Принятие экзамена:",
          value: "<:1057686403556835339:1280857058937405510>10 Баллов",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Проведение инструктажа:",
          value: "<:1057686403556835339:1280857058937405510>20 Баллов",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Проверка одного отчета интернов:",
          value: "<:1057686403556835339:1280857058937405510>10 Баллов",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Проверка одного электронного заявления:",
          value: "<:1057686403556835339:1280857058937405510>10 Баллов",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Подача гос. волны о наборе:",
          value: "<:1057686403556835339:1280857058937405510>10 Баллов",
          inline: false,
        },
      ],
      image: {
        url: "https://i.imgur.com/I58UQZH.png",
      },
    },
    psedPoints: {
      title: "Система баллов для отдела PSED",
      color: "d39d39",
      fields: [
        {
          name: "<:1045037119904694332:1280857061332095051>Выдача мед. справок:",
          value:
            "<:1057686403556835339:1280857058937405510>В больнице PillBox *[За 1 справку]* - 2 Балла\n<:1057686403556835339:1280857058937405510>В больницах Sandy Shores и Paleto Bay *[За 1 справку]* - 4 Балла",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Проведение/Участие в проверке гос. структур:",
          value: "<:1057686403556835339:1280857058937405510>40 Баллов",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Подача гос. волны о выдаче справок:",
          value: "<:1057686403556835339:1280857058937405510>10 Баллов",
          inline: false,
        },
      ],
      image: {
        url: "https://i.imgur.com/D13WIql.png"
      }
    },
    fdPoints: {
      title: "Система баллов для отдела FD",
      color: "e9600c",
      fields: [
        {
          name: "<:1045037119904694332:1280857061332095051>Тушение пожара:",
          value:
            "<:1057686403556835339:1280857058937405510>В городе - 3 Балла\n<:1057686403556835339:1280857058937405510>В пригороде - 5 Балла",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Проведение/Участие в проверке гос. структур:",
          value: "<:1057686403556835339:1280857058937405510>40 Баллов",
          inline: false,
        },
      ],
      image: {
        url: "https://i.imgur.com/ihnptVp.png"
      }
    },
    hadPoints: {
      title: "Система баллов для отдела HAD",
      color: "ff0a0e",
      fields: [
        {
          name: "<:1045037119904694332:1280857061332095051>Проведение проверок по рации:",
          value:
            "<:1057686403556835339:1280857058937405510>За 1-го сотрудника - 10 Баллов *(максимум 5 человек, интервал между проверками 2 часа)*",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Проведение брифинга:",
          value:
            "<:1057686403556835339:1280857058937405510>65 Баллов *[3 участия приравнивается к 1 проведению]*",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Проверка на прогулы::",
          value:
            "<:1057686403556835339:1280857058937405510>35 Баллов *(минимум 7 мест, интервал между проверками 1 час)*",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Проверка склада:",
          value:
            "<:1057686403556835339:1280857058937405510>За 10 проверенных сотрудников - 40 Баллов",
          inline: false,
        },
        {
          name: "",
          value: "",
          inline: false,
        },
        {
          name: "<:1045037119904694332:1280857061332095051>Выдача выговоров:",
          value:
            "<:1057686403556835339:1280857058937405510>За каждый одобренный выговор - 5 Баллов",
          inline: false,
        },
      ],
      image: {
        url: "https://i.imgur.com/4jLx3f7.png"
      }
    },
  },
};
